#身爲一個優秀的小神厨，小當家的食材都是自己精心挑選的。
#這次他打算挑戰以不同種煮法去處理一條魚，所以他打算去養殖場挑魚。
#已知養殖場裏面有N 個池子，每個池子裏面有數量不定的魚。
#養殖場老闆給了小當家一個大網子，讓小當家一次可以撈K條魚上來。
#由於小當家是個完美主義者，衹要池裏的魚少過K條他就不打算再撈了。（因爲撈到的魚一定少於K）
#所以一旦他不在這池撈魚他就會換去下一個池塘，直到全部池塘都不能再撈魚為止。(就是全部池塘的魚少過K條)
#請問他這一趟可以最多可以撈到多少條魚呢？

x=input().split()
y=input().split()
z=[]
for i in range(len(x)):
    x[i]=eval(x[i])
    len(x) == len(y)

for j in range(len(y)):
    gain=int(y[j])/int(x[1])
    fish=int(x[1])*int(gain)
    z.append(int(fish))
print(sum(z))




